{
  "backend/main.mo": "Motoko actor managing user profiles with access control, letting users view and save their own profile data.",
  "feature_evidence.json": "Feature-evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file in the project.",
  "frontend/index.css": "Tailwind base/theme setup defining light/dark color variables and applying global background and text styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling login state, onboarding flow, and showing the practice view after setup.",
  "frontend/src/components/chart/ChartImporter.tsx": "UI component for importing JSON or MIDI note charts, parsing them, and returning structured chart data.",
  "frontend/src/components/feedback/HitFeedback.tsx": "Displays keyboard mapping instructions and shows hit/miss feedback animations based on input timing.",
  "frontend/src/components/layout/AppShell.tsx": "Top-level layout with header, account menu, login/logout handling, footer, and optional name-change dialog.",
  "frontend/src/components/pianoroll/PianoRoll.tsx": "Canvas-based falling-note piano roll that draws lanes, notes, and hit state based on timing and input.",
  "frontend/src/components/pianoroll/TransportControls.tsx": "Playback controls providing start, pause, stop, and a formatted time display for practice sessions.",
  "frontend/src/components/profile/NameOnboarding.tsx": "Onboarding form that loads and updates the user's profile name with save handling and validation.",
  "frontend/src/components/youtube/YouTubeEmbed.tsx": "Embeds a YouTube video using an iframe with a styled container and title.",
  "frontend/src/components/youtube/YouTubePicker.tsx": "URL input that validates a YouTube link, extracts the video ID, and triggers loading with error feedback.",
  "frontend/src/features/practice/PracticeView.tsx": "Main practice screen handling YouTube selection, chart importing, persistence, and rendering playback tools.",
  "frontend/src/features/practice/useHitDetection.ts": "Hook that detects note hits or misses within a timing window and tracks hit state and hit notes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity login, persistence, and status handling.",
  "frontend/src/hooks/useKeyboardInput.ts": "Maps keyboard events to lane presses and records the last pressed key with timestamps.",
  "frontend/src/hooks/usePracticeTransport.ts": "Provides a transport hook that tracks play state, current time, and supports start, pause, stop, and seek using requestAnimationFrame.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query calls to fetch and save the caller’s user profile using an actor instance.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables, dark mode overrides, and scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/noteChart.ts": "Type definitions for Note and NoteChart used in piano-roll rendering and parsing.",
  "frontend/src/utils/chartParsers.ts": "Parses JSON note charts into NoteChart objects and provides a placeholder MIDI parser that throws an error.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/youtube.ts": "Validates YouTube URLs and extracts video IDs from standard and short-link formats.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and other theme settings using custom CSS variables.",
  "project_state.json": "Metadata describing project state, requirements, existing features, and image needs."
}